# GetOpeningSolids Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCOpeningData..::..GetOpeningSolids Method
IFCOpeningData Class See Also
---
Gets opening solids.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<Solid> GetOpeningSolids()
```

Visual Basic
---
```text
Public Function GetOpeningSolids As IList(Of Solid)
```

Visual C++
---
```text
public:
IList<Solid^>^ GetOpeningSolids()
```

# ### Return Value
The solids.
# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace